In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

In [2]:
state_df=pd.read_csv(r"C:\covid-19-data-master\us-states.csv")

In [3]:
state_df.head(n=10)

         date       state  fips  cases  deaths
0  2020-01-21  Washington    53      1       0
1  2020-01-22  Washington    53      1       0
2  2020-01-23  Washington    53      1       0
3  2020-01-24    Illinois    17      1       0
4  2020-01-24  Washington    53      1       0
5  2020-01-25  California     6      1       0
6  2020-01-25    Illinois    17      1       0
7  2020-01-25  Washington    53      1       0
8  2020-01-26     Arizona     4      1       0
9  2020-01-26  California     6      2       0

In [4]:
valid_states=["Washington","California","New York"]

In [11]:
selection=state_df['state'].isin(valid_states)

In [12]:
state_trimmed=state_df.loc[selection]

In [13]:
state_trimmed

             date       state     cases
0      2020-01-21  Washington         1
1      2020-01-22  Washington         1
2      2020-01-23  Washington         1
4      2020-01-24  Washington         1
5      2020-01-25  California         1
...           ...         ...       ...
56880  2022-12-23    New York   6523020
56898  2022-12-23  Washington   1879139
56907  2022-12-24  California  11772574
56936  2022-12-24    New York   6526059
56954  2022-12-24  Washington   1879139

[3163 rows x 3 columns]

In [9]:
columns=["date","state","cases"]
state_df=state_df[columns]

In [10]:
state_df

             date          state    cases
0      2020-01-21     Washington        1
1      2020-01-22     Washington        1
2      2020-01-23     Washington        1
3      2020-01-24       Illinois        1
4      2020-01-24     Washington        1
...           ...            ...      ...
56953  2022-12-24       Virginia  2190699
56954  2022-12-24     Washington  1879139
56955  2022-12-24  West Virginia   621614
56956  2022-12-24      Wisconsin  1954481
56957  2022-12-24        Wyoming   182581

[56958 rows x 3 columns]

In [14]:
state_trimmed

             date       state     cases
0      2020-01-21  Washington         1
1      2020-01-22  Washington         1
2      2020-01-23  Washington         1
4      2020-01-24  Washington         1
5      2020-01-25  California         1
...           ...         ...       ...
56880  2022-12-23    New York   6523020
56898  2022-12-23  Washington   1879139
56907  2022-12-24  California  11772574
56936  2022-12-24    New York   6526059
56954  2022-12-24  Washington   1879139

[3163 rows x 3 columns]